app/controllers/todo_items_controller.rb

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 14]]
---
  def destroy
    # @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.destroy