app/controllers/todo_lists_controller.rb

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "desccription", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dfg"], ["desccription", "dsfgs"], ["created_at", "2020-04-23 11:42:59.346429"], ["updated_at", "2020-04-23 11:42:59.346429"]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "title" = ?, "desccription" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["title", ""], ["desccription", ""], ["updated_at", "2020-04-23 11:43:11.076598"], ["id", 1]]